##UPDATING ROWS AND COLUMNS

In [112]:
import pandas as pd
people={
    "first":['Eman','Nada','Hala'],
    "last":['sami','yasser','mourad'],
    "email":['esamy369@gmail','nada3342@gmail','hal232@gmai']
}

In [113]:
df=pd.DataFrame(people)

In [114]:
 #show all columns
df.columns

Index(['first', 'last', 'email'], dtype='object')

In [115]:
 #to change a columns names rewrite the columns
df.columns=["first_name","last_name","email"]

In [116]:
 #show the new columns
df.columns

Index(['first_name', 'last_name', 'email'], dtype='object')

In [117]:
 #show the data after changing the columns names
df

  first_name last_name           email
0       Eman      sami  esamy369@gmail
1       Nada    yasser  nada3342@gmail
2       Hala    mourad     hal232@gmai

In [118]:
 #making all columns lower
df.columns=[x.lower() for x in df.columns]
df

  first_name last_name           email
0       Eman      sami  esamy369@gmail
1       Nada    yasser  nada3342@gmail
2       Hala    mourad     hal232@gmai

In [119]:
 #replacing (_) with space( ) 
df.columns=df.columns.str.replace("_"," ")

In [120]:
df

  first name last name           email
0       Eman      sami  esamy369@gmail
1       Nada    yasser  nada3342@gmail
2       Hala    mourad     hal232@gmai

In [121]:
 #rename a specific column instead of all columns
df.rename(columns={"first name":"first","last name":"last"},inplace=True)
 #print df
df

  first    last           email
0  Eman    sami  esamy369@gmail
1  Nada  yasser  nada3342@gmail
2  Hala  mourad     hal232@gmai

using str -------str.lower()
                 str.upper()
                 str.replace()

In [122]:
 #changing the second row data
df.loc[2] =["Hala","ahmed","shady1234@gmail"]

In [123]:
 #show the new data
df

  first    last            email
0  Eman    sami   esamy369@gmail
1  Nada  yasser   nada3342@gmail
2  Hala   ahmed  shady1234@gmail

In [124]:
 #showing 3rd row with 2 specific columns
df.loc[2,["last","email"]]

last               ahmed
email    shady1234@gmail
Name: 2, dtype: object

In [125]:
 #using loc with 3rd row and 3rd,4rd columns and changing thier values 
df.loc[2,["last","email"]]=["mourad","hal232@gmai"]

In [126]:
df

  first    last           email
0  Eman    sami  esamy369@gmail
1  Nada  yasser  nada3342@gmail
2  Hala  mourad     hal232@gmai

In [127]:
#using at that equal to loc with 3rd row and 3rd,4rd columns and changing thier values 
df.at[2,["last","email"]]=["mourad","hal232@gmai"]

In [128]:
df

  first    last           email
0  Eman    sami  esamy369@gmail
1  Nada  yasser  nada3342@gmail
2  Hala  mourad     hal232@gmai

In [129]:
filt=df['email']=='hal232@gmai'
df[filt]

  first    last        email
2  Hala  mourad  hal232@gmai

In [130]:
#NOTE
#if we tried to change a column without using loc or iloc an error will appear

df[filt]['last']='Ali'

C:\Users\Eman\AppData\Local\Temp\ipykernel_3100\1880047291.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df[filt]['last']='Ali'

In [131]:
 #the right way
df.loc[filt,'last']='Ali'

In [132]:
df

  first    last           email
0  Eman    sami  esamy369@gmail
1  Nada  yasser  nada3342@gmail
2  Hala     Ali     hal232@gmai

In [133]:
 #two ways to use lower()
 #1
df.email=[x.lower() for x in df.email]
print(df)
print('\n')
 #2
df['email']=df['email'].str.lower()
print(df)
print('\n')
 #3

  first    last           email
0  Eman    sami  esamy369@gmail
1  Nada  yasser  nada3342@gmail
2  Hala     Ali     hal232@gmai


  first    last           email
0  Eman    sami  esamy369@gmail
1  Nada  yasser  nada3342@gmail
2  Hala     Ali     hal232@gmai

 USING APPLY

In [134]:
 #apply helps us to use ((((((((functions))))))))
 # like len 
df.email.apply(len)

0    14
1    14
2    11
Name: email, dtype: int64

In [135]:
 #this way print the len of the email column
print(len(df.email))

3

In [136]:
 # try a function
def update_email(email):
    return email.upper() 
    
df.email.apply(update_email)

0    ESAMY369@GMAIL
1    NADA3342@GMAIL
2       HAL232@GMAI
Name: email, dtype: object

In [137]:
 # make it lower again
df.email=df.email.str.lower()
df

  first    last           email
0  Eman    sami  esamy369@gmail
1  Nada  yasser  nada3342@gmail
2  Hala     Ali     hal232@gmai

In [138]:
 # another way to make lower using lambda
df.email=df.email.apply(lambda x: x.lower()) 
df

  first    last           email
0  Eman    sami  esamy369@gmail
1  Nada  yasser  nada3342@gmail
2  Hala     Ali     hal232@gmai

In [140]:
 #when we didn't determine a column it will get the len series in data frame (how many row in each column )
df.apply(len)

first    3
last     3
email    3
dtype: int64

In [141]:
 # found the minimum according to The alphabet letters
df.apply(lambda x: x.min())

first    Eman
last      Ali
email      11
dtype: object

In [142]:
 # the same as using lambda
 # this is more efficient when we use numbers.
df.apply(pd.Series.min)

first    Eman
last      Ali
email      11
dtype: object

applymap apply functions on every element

In [ ]:
 # the len of each item
df.applymap(len)

   first  last  email
0      4     4     14
1      4     6     14
2      4     3     11

In [ ]:
 #make each letter in each item lower
df.applymap(str.lower)

  first    last           email
0  eman    sami  esamy369@gmail
1  nada  yasser  nada3342@gmail
2  hala     ali     hal232@gmai

remember that map works om series that mean it works in each item

In [ ]:
 # here we using replace on an item in first row with another thing
df['first']=df['first'].replace({'Eman':'hoda','Nada':'aya'})

In [149]:
df

  first    last  email
0  Eman    sami     14
1  Nada  yasser     14
2  Hala     Ali     11

In [153]:
 # can use map to change a column data
df['first']=df['first'].map({"Hala":"blal"})

 # more explaination in our real data 
df['Hobbyist'].map({'Yes':True ,'No':False})

In [154]:
df

  first    last  email
0   NaN    sami     14
1   NaN  yasser     14
2  blal     Ali     11

In [155]:
# can use replace too
df['first']=df['first'].replace({"Hala":"blal"})

In [156]:
df

  first    last  email
0   NaN    sami     14
1   NaN  yasser     14
2  blal     Ali     11